CALENDLY_URL = "https://calendly.com/d/cqwz-rcw-cr6/youmatch-agent-call?utm_source=website"

MAIN_PROMPT = f"""
Ты – чат-бот-помощник для клиентов YouMatch, элитного клуба знакомств нового поколения. Твоя задача – кратко и понятно рассказать о программе и помочь записаться на консультационный звонок, сохраняя атмосферу эксклюзивности и индивидуального подхода. Общайся на «вы» в дружелюбном, но профессиональном тоне.

Ключевые моменты:

ВАЖНО!!! Ни в коем случае не используй формулировки вроде "Услуги могут показаться несколько дорогими" или "Стоимость наших услуг может показаться высокой" или подобные.

Индивидуальный подход: персональное сопровождение для подбора идеального партнёра.
Ограниченный доступ: YouMatch – закрытый клуб для избранных, доступный не всем.
Ценность звонка: консультация с ассистентом и психологом – важный шаг для понимания ваших потребностей.
На вопросы отвечай кратко и по существу, избегая лишней информации. Разбивай текст на абзацы и списки для удобства чтения. Каждое новое предложение начинай с новой строки.

Если пользователь просит связаться с живым человеком, или оператором отвечай:
"Конечно, вы всегда можете связаться с нашим экспертом, нажав на команду /help"

Если пользователь написал "Старт", отвечай: "Для возврата к стартовому сообщению нажмите /start"
Если пользователь просит записать его на звонок, отправляй ему сообщение: "Если вы хотите записаться на интервью, нажмите /bookcall"
"""

COMMANDS_LIST = """
/start – Начать работу
/bookcall – Записаться на интервью
/profile – Заполнить анкету
/help – Связаться с экспертом
/info – Подробнее о YouMatch
"""

HELP_TEXT = "Нажмите на кнопку ниже, чтобы связаться с нашим экспертом:"

ABOUT_YOUMATCH = """
YouMatch - это дейтинг нового поколения для тех, кто ищет настоящие, долгосрочные отношения. Мы предлагаем индивидуальный подход к каждому клиенту, используя передовые технологии ИИ и последние исследования психологической совместимости.\n
Наша цель - помочь найти партнера, с которым у вас высокая вероятность построить здоровые отношения, минуя бесконечные свайпы и пустые переписки.

Вступление в клуб YouMatch состоит из 3 этапов:\n
1.	Краткое интервью с экспертом отдела заботы, чтобы понять, подходим ли мы друг другу.
2.	Сессия с психологом для подробного изучения вашего запроса.
3.	Выбор тарифа и старт подбора пары.

Подробно о принципах, на которых основана наша работа, вам расскажет основатель YouMatch Станислав в этом интервью:
"""

STEP_WELCOME = """
Мы создали YouMatch для тех, кто ищет серьёзные отношения и не хочет тратить время на бесконечные свайпы и пустые переписки. \n
Перед вступлением в клуб мы проведем с вами интервью, чтобы подобрать людей, подходящих вам по характеру, эмоциям и ценностям.\n
Записаться на интервью можно, нажав кнопку ниже.

Если хотите узнать больше, задайте вопрос или нажмите /info.
"""

STEP_RESULT = """
Спасибо за заполнение анкеты! \n
Примите подарок от нашей команды психологов - гайд по осознанным и гармоничным отношениям.\n
Предлагаем записаться на бесплатный разбор с персональным ассистентом YouMatch по ссылке ниже.\n
На встрече мы разберем, как вы сможете построить длительные отношения 
"""

STEP_1 = """
Мы уверены, что каждый человек заслуживает здоровых отношений! \n
Заполните короткую анкету, чтобы мы лучше узнали вашу ситуацию и поделились полезным гайдом «Проводник к осознанным и гармоничным отношениям»
"""

STEP_2 = """
        Позволь задать тебе 2 вопроса, чтобы лучше тебя понять. Насколько тебе важно, чтобы будущий партнер подходил тебе по характеру, эмоциям и взглядам на жизнь?
"""

STEP_3 = """
        YouMatch также помогает находить партнера с похожими жизненными ценностями. Какие ценности для тебя наиболее важны в отношениях?
"""

STEP_4 = """
        Спасибо за ответы! Теперь мы готовы провести с тобой более подробное интервью, чтобы лучше понять твою личность и подобрать кандидатов, с которыми у тебя будет максимальный шанс построить здоровые отношения. \n
Хочешь записаться на звонок с персональным ассистентом, чтобы начать процесс вступления в клуб?
"""

STEP_5 = f"""
        Отлично! Для записи выбери удобное время через наш сервис: \n
{CALENDLY_URL}\n\n
Ждем тебя на звонке! Пока ждешь, посмотри наш контент: [ссылка/видео/фото]
"""

STEP_6 = """
        Наша задача – дать пользователям возможность найти партнера, подходящего по характеру, эмоциям и взглядам на жизнь, жизненным ценностям. \n
Именно поэтому тебе не придется тратить время на бесконечные свайпы и разговоры со «случайными» людьми — мы предложим тебе только тех людей, с которыми у тебя максимальный шанс построить крепкие отношения. \n
Хочешь попробовать?
"""

STEP_7 = f"""
        Конечно, это важное решение, и я понимаю, что иногда нужно время на обдумывание. \n
Если появятся вопросы или захочешь записаться на звонок, ты всегда можешь обратиться к своему персональному ассистенту: {CALENDLY_URL}\n
Удачи в поиске идеальной пары! 💖

(заглушка для контента)
"""